In [7]:
import pandas as pd
import sqlalchemy as db
from getpass import getpass

In [2]:
user = "root"
password = getpass("Insert password: ")

Insert password: ········

In [3]:
connectionURI = f"mysql+pymysql://{user}:{password}@localhost/publications"

In [4]:
engine = db.create_engine(connectionURI)
print("Connected to server!")

Connected to server!

In [10]:
df = pd.read_sql_query("""SELECT a.au_id AUTHOR_ID, a.au_fname LAST_NAME, a.au_lname NAME,title TITLE, pub_name PUBLISHERS 
FROM authors a
LEFT JOIN titleauthor ta ON ta.au_id = a.au_id
INNER JOIN titles t ON t.title_id = ta.title_id
LEFT JOIN publishers p ON p.pub_id = t.pub_id;""",engine)
df.head()

,AUTHOR_ID,LAST_NAME,NAME,TITLE,PUBLISHERS
0,213-46-8915,Marjorie,Green,The Busy Executive's Database Guide,Algodata Infosystems
1,409-56-7008,Abraham,Bennet,The Busy Executive's Database Guide,Algodata Infosystems
2,267-41-2394,Michael,O'Leary,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems
3,724-80-9391,Stearns,MacFeather,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems
4,213-46-8915,Marjorie,Green,You Can Combat Computer Stress!,New Moon Books

In [ ]:
#CHALLENGE 2

In [12]:
df2 = pd.read_sql_query("""SELECT a.au_id AUTHOR_ID, a.au_fname LAST_NAME, a.au_lname NAME, QTY
FROM authors a
LEFT JOIN titleauthor ta ON ta.au_id = a.au_id
LEFT JOIN titles t ON t.title_id = ta.title_id
LEFT JOIN(
SELECT  sum(qty) AS QTY, title_id
FROM sales s
group by title_id) s ON s.title_id = t.title_id
ORDER BY QTY DESC
LIMIT 5;""",engine)

df2

     AUTHOR_ID LAST_NAME      NAME    QTY
0  899-46-2035      Anne    Ringer  108.0
1  998-72-3567    Albert    Ringer  108.0
2  846-92-7186    Sheryl    Hunter   50.0
3  427-17-2319       Ann      Dull   50.0
4  807-91-6654    Sylvia  Panteley   40.0

In [28]:
df2 = pd.read_sql_query("""SELECT a.au_id AUTHOR_ID, a.au_fname LAST_NAME, a.au_lname NAME, TOTAL
FROM authors a
LEFT JOIN titleauthor ta ON ta.au_id = a.au_id
LEFT JOIN titles t ON t.title_id = ta.title_id
LEFT JOIN(
SELECT  sum(qty) AS TOTAL, title_id
FROM sales s
group by title_id) s ON s.title_id = t.title_id
ORDER BY TOTAL DESC
;""",engine)


df2

      AUTHOR_ID    LAST_NAME            NAME  TOTAL
0   899-46-2035         Anne          Ringer  108.0
1   998-72-3567       Albert          Ringer  108.0
2   427-17-2319          Ann            Dull   50.0
3   846-92-7186       Sheryl          Hunter   50.0
4   722-51-5454       Michel        DeFrance   40.0
5   807-91-6654       Sylvia        Panteley   40.0
6   899-46-2035         Anne          Ringer   40.0
7   213-46-8915     Marjorie           Green   35.0
8   238-95-7766       Cheryl          Carson   30.0
9   267-41-2394      Michael         O'Leary   25.0
10  486-29-1786     Charlene        Locksley   25.0
11  724-80-9391      Stearns      MacFeather   25.0
12  998-72-3567       Albert          Ringer   25.0
13  267-41-2394      Michael         O'Leary   20.0
14  472-27-2349         Burt      Gringlesby   20.0
15  648-92-1872     Reginald  Blotchet-Halls   20.0
16  672-71-3249        Akiko        Yokomoto   20.0
17  724-80-9391      Stearns      MacFeather   20.0
18  756-30-7391        Livia          Karsen   20.0
19  172-32-1176      Johnson           White   15.0
20  213-46-8915     Marjorie           Green   15.0
21  274-80-9391         Dean        Straight   15.0
22  409-56-7008      Abraham          Bennet   15.0
23  712-45-1867        Innes    del Castillo   10.0
24  341-22-1782      Meander           Smith    NaN
25  486-29-1786     Charlene        Locksley    NaN
26  527-72-3246  Morningstar          Greene    NaN
27  724-08-9931         Dirk        Stringer    NaN
28  893-72-1158      Heather        McBadden    NaN